## SERIES - 1 DIMENSIONAL ARRAY

In [2]:
# Series can hold any data type: integers, strings, floats
import pandas as pd

In [11]:
x = pd.Series([10,20,30], index = ['a','b','c'])
x.index

array([10, 20, 30])

In [13]:
x.values

array([10, 20, 30])

In [17]:
x['a']

np.int64(10)

### DICTIONARY

In [19]:
### DICTIONARY out a SERIES
sales_dict = x.to_dict()
sales_dict

{'a': 10, 'b': 20, 'c': 30}

In [21]:
### SERIES out of a DICTIONARY
sales_ser = pd.Series(sales_dict)
sales_ser

a    10
b    20
c    30
dtype: int64

## DATAFRAME - 2 DIMENSIONAL ARRAY

In [23]:
# DATAFRAME is a 2DIMENSIONAL labeled data structure, like a table
# each column is like a 1D seriescomposed of series
# has row indexes

# CREATE A DATAFRAME OUT OF SERIES
data = [['Adrian',20],['Bethany',23],['Chloe',41]]
df = pd.DataFrame(data, columns=['Name','Age'], index=['rank1','rank2','rank3'])
df

          Name  Age
rank1   Adrian   20
rank2  Bethany   23
rank3    Chloe   41

In [25]:
# CREATE A DATAFRAME OUT OF DICTIONAIRIES
dict_list = [{'Name':'Tom','Sales':250}, {'Name':'Jane'},{'Name':'Steve','Sales':350}]
df2 = pd.DataFrame(dict_list)
df2

    Name  Sales
0    Tom  250.0
1   Jane    NaN
2  Steve  350.0

In [43]:
df2 = pd.DataFrame(dict_list, index=['no1','no2','no3'])
df2

      Name  Sales
no1    Tom  250.0
no2   Jane    NaN
no3  Steve  350.0

In [44]:
# FORWARD FILL
df2.fillna(method="ffill")  # forward fill

# BACKWARD FILLE
df2.fillna(method="bfill")  # backward fill

# INTERPOLATE
df2.interpolate()

# DROP NA
df2.dropna()

#DROP DUPLICATES
df2.drop_duplicates()

/var/folders/qv/dzzbgwwd3lx5227l6qt6cvmh0000gn/T/ipykernel_71230/3586541019.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df2.fillna(method="ffill")  # forward fill
/var/folders/qv/dzzbgwwd3lx5227l6qt6cvmh0000gn/T/ipykernel_71230/3586541019.py:5: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df2.fillna(method="bfill")  # backward fill
/var/folders/qv/dzzbgwwd3lx5227l6qt6cvmh0000gn/T/ipykernel_71230/3586541019.py:8: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df2.interpolate()

      Name  Sales
no1    Tom  250.0
no2   Jane    NaN
no3  Steve  350.0

### ILOC , LOC

In [52]:
# ILOC  -  integer location based indexing
df2.iloc[0]   # first row
df2.iloc[0,1] # first row, second column
df.iloc[0:2,1:3] # first 2 rows, columns 2 and 3

# LOC   -  label based indexing 
df2.loc['no1']

Name       Tom
Sales    250.0
Name: no1, dtype: object

In [54]:
df2.iloc[0,1] # first row, second column

np.float64(250.0)

In [55]:
df.iloc[0:2,1:3] # first 2 rows, columns 2 and 3

       Age
rank1   20
rank2   23

In [57]:
df2.describe()

            Sales
count    2.000000
mean   300.000000
std     70.710678
min    250.000000
25%    275.000000
50%    300.000000
75%    325.000000
max    350.000000